espressif/esp-idf/components/soc/esp32h4/register/soc/ahb_dma_reg.h
/** AHB_DMA_OUT_INT_ENA_CH4_REG register
 *  Interrupt enable bits of TX channel 4
 */
#define AHB_DMA_OUT_INT_ENA_CH4_REG (DR_REG_AHB_BASE + 0x98)
/** AHB_DMA_OUT_DONE_CH4_INT_ENA : R/W; bitpos: [0]; default: 0;
 *  Write 1 to enable AHB_DMA_OUT_DONE_CH4_INT.
 */
#define AHB_DMA_OUT_DONE_CH4_INT_ENA    (BIT(0))
#define AHB_DMA_OUT_DONE_CH4_INT_ENA_M  (AHB_DMA_OUT_DONE_CH4_INT_ENA_V << AHB_DMA_OUT_DONE_CH4_INT_ENA_S)
#define AHB_DMA_OUT_DONE_CH4_INT_ENA_V  0x00000001U
#define AHB_DMA_OUT_DONE_CH4_INT_ENA_S  0
/** AHB_DMA_OUT_EOF_CH4_INT_ENA : R/W; bitpos: [1]; default: 0;
 *  Write 1 to enable AHB_DMA_OUT_EOF_CH4_INT.
 */
#define AHB_DMA_OUT_EOF_CH4_INT_ENA    (BIT(1))
#define AHB_DMA_OUT_EOF_CH4_INT_ENA_M  (AHB_DMA_OUT_EOF_CH4_INT_ENA_V << AHB_DMA_OUT_EOF_CH4_INT_ENA_S)
#define AHB_DMA_OUT_EOF_CH4_INT_ENA_V  0x00000001U
#define AHB_DMA_OUT_EOF_CH4_INT_ENA_S  1
/** AHB_DMA_OUT_DSCR_ERR_CH4_INT_ENA : R/W; bitpos: [2]; default: 0;
 *  Write 1 to enable AHB_DMA_OUT_DSCR_ERR_CH4_INT.
 */
#define AHB_DMA_OUT_DSCR_ERR_CH4_INT_ENA    (BIT(2))
#define AHB_DMA_OUT_DSCR_ERR_CH4_INT_ENA_M  (AHB_DMA_OUT_DSCR_ERR_CH4_INT_ENA_V << AHB_DMA_OUT_DSCR_ERR_CH4_INT_ENA_S)
#define AHB_DMA_OUT_DSCR_ERR_CH4_INT_ENA_V  0x00000001U
#define AHB_DMA_OUT_DSCR_ERR_CH4_INT_ENA_S  2
/** AHB_DMA_OUT_TOTAL_EOF_CH4_INT_ENA : R/W; bitpos: [3]; default: 0;
 *  Write 1 to enable AHB_DMA_OUT_TOTAL_EOF_CH4_INT.
 */
#define AHB_DMA_OUT_TOTAL_EOF_CH4_INT_ENA    (BIT(3))
#define AHB_DMA_OUT_TOTAL_EOF_CH4_INT_ENA_M  (AHB_DMA_OUT_TOTAL_EOF_CH4_INT_ENA_V << AHB_DMA_OUT_TOTAL_EOF_CH4_INT_ENA_S)
#define AHB_DMA_OUT_TOTAL_EOF_CH4_INT_ENA_V  0x00000001U
#define AHB_DMA_OUT_TOTAL_EOF_CH4_INT_ENA_S  3
/** AHB_DMA_OUTFIFO_OVF_CH4_INT_ENA : R/W; bitpos: [4]; default: 0;
 *  Write 1 to enable AHB_DMA_OUTFIFO_OVF_CH4_INT.
 */
#define AHB_DMA_OUTFIFO_OVF_CH4_INT_ENA    (BIT(4))
#define AHB_DMA_OUTFIFO_OVF_CH4_INT_ENA_M  (AHB_DMA_OUTFIFO_OVF_CH4_INT_ENA_V << AHB_DMA_OUTFIFO_OVF_CH4_INT_ENA_S)
#define AHB_DMA_OUTFIFO_OVF_CH4_INT_ENA_V  0x00000001U
#define AHB_DMA_OUTFIFO_OVF_CH4_INT_ENA_S  4
/** AHB_DMA_OUTFIFO_UDF_CH4_INT_ENA : R/W; bitpos: [5]; default: 0;
 *  Write 1 to enable AHB_DMA_OUTFIFO_UDF_CH4_INT.
 */
#define AHB_DMA_OUTFIFO_UDF_CH4_INT_ENA    (BIT(5))
#define AHB_DMA_OUTFIFO_UDF_CH4_INT_ENA_M  (AHB_DMA_OUTFIFO_UDF_CH4_INT_ENA_V << AHB_DMA_OUTFIFO_UDF_CH4_INT_ENA_S)
#define AHB_DMA_OUTFIFO_UDF_CH4_INT_ENA_V  0x00000001U
#define AHB_DMA_OUTFIFO_UDF_CH4_INT_ENA_S  5
/** AHB_DMA_OUT_AHBINF_RESP_ERR_CH4_INT_ENA : R/W; bitpos: [6]; default: 0;
 *  Write 1 to enable AHB_DMA_OUT_RESP_ERR_CH4_INT.
 */
#define AHB_DMA_OUT_AHBINF_RESP_ERR_CH4_INT_ENA    (BIT(6))
#define AHB_DMA_OUT_AHBINF_RESP_ERR_CH4_INT_ENA_M  (AHB_DMA_OUT_AHBINF_RESP_ERR_CH4_INT_ENA_V << AHB_DMA_OUT_AHBINF_RESP_ERR_CH4_INT_ENA_S)
#define AHB_DMA_OUT_AHBINF_RESP_ERR_CH4_INT_ENA_V  0x00000001U
#define AHB_DMA_OUT_AHBINF_RESP_ERR_CH4_INT_ENA_S  6

/** AHB_DMA_OUT_INT_CLR_CH4_REG register
 *  Interrupt clear bits of TX channel 4
 */
#define AHB_DMA_OUT_INT_CLR_CH4_REG (DR_REG_AHB_BASE + 0x9c)
/** AHB_DMA_OUT_DONE_CH4_INT_CLR : WT; bitpos: [0]; default: 0;
 *  Write 1 to clear AHB_DMA_OUT_DONE_CH4_INT.
 */
#define AHB_DMA_OUT_DONE_CH4_INT_CLR    (BIT(0))
#define AHB_DMA_OUT_DONE_CH4_INT_CLR_M  (AHB_DMA_OUT_DONE_CH4_INT_CLR_V << AHB_DMA_OUT_DONE_CH4_INT_CLR_S)
#define AHB_DMA_OUT_DONE_CH4_INT_CLR_V  0x00000001U
#define AHB_DMA_OUT_DONE_CH4_INT_CLR_S  0
/** AHB_DMA_OUT_EOF_CH4_INT_CLR : WT; bitpos: [1]; default: 0;
 *  Write 1 to clear AHB_DMA_OUT_EOF_CH4_INT.
 */
#define AHB_DMA_OUT_EOF_CH4_INT_CLR    (BIT(1))
#define AHB_DMA_OUT_EOF_CH4_INT_CLR_M  (AHB_DMA_OUT_EOF_CH4_INT_CLR_V << AHB_DMA_OUT_EOF_CH4_INT_CLR_S)
#define AHB_DMA_OUT_EOF_CH4_INT_CLR_V  0x00000001U
#define AHB_DMA_OUT_EOF_CH4_INT_CLR_S  1
/** AHB_DMA_OUT_DSCR_ERR_CH4_INT_CLR : WT; bitpos: [2]; default: 0;
 *  Write 1 to clear AHB_DMA_OUT_DSCR_ERR_CH4_INT.
 */
#define AHB_DMA_OUT_DSCR_ERR_CH4_INT_CLR    (BIT(2))
#define AHB_DMA_OUT_DSCR_ERR_CH4_INT_CLR_M  (AHB_DMA_OUT_DSCR_ERR_CH4_INT_CLR_V << AHB_DMA_OUT_DSCR_ERR_CH4_INT_CLR_S)
#define AHB_DMA_OUT_DSCR_ERR_CH4_INT_CLR_V  0x00000001U
#define AHB_DMA_OUT_DSCR_ERR_CH4_INT_CLR_S  2
/** AHB_DMA_OUT_TOTAL_EOF_CH4_INT_CLR : WT; bitpos: [3]; default: 0;
 *  Write 1 to clear AHB_DMA_OUT_TOTAL_EOF_CH4_INT.
 */
#define AHB_DMA_OUT_TOTAL_EOF_CH4_INT_CLR    (BIT(3))
#define AHB_DMA_OUT_TOTAL_EOF_CH4_INT_CLR_M  (AHB_DMA_OUT_TOTAL_EOF_CH4_INT_CLR_V << AHB_DMA_OUT_TOTAL_EOF_CH4_INT_CLR_S)
#define AHB_DMA_OUT_TOTAL_EOF_CH4_INT_CLR_V  0x00000001U
#define AHB_DMA_OUT_TOTAL_EOF_CH4_INT_CLR_S  3
/** AHB_DMA_OUTFIFO_OVF_CH4_INT_CLR : WT; bitpos: [4]; default: 0;
 *  Write 1 to clear AHB_DMA_OUTFIFO_OVF_CH4_INT.
 */
#define AHB_DMA_OUTFIFO_OVF_CH4_INT_CLR    (BIT(4))
#define AHB_DMA_OUTFIFO_OVF_CH4_INT_CLR_M  (AHB_DMA_OUTFIFO_OVF_CH4_INT_CLR_V << AHB_DMA_OUTFIFO_OVF_CH4_INT_CLR_S)
#define AHB_DMA_OUTFIFO_OVF_CH4_INT_CLR_V  0x00000001U
#define AHB_DMA_OUTFIFO_OVF_CH4_INT_CLR_S  4
/** AHB_DMA_OUTFIFO_UDF_CH4_INT_CLR : WT; bitpos: [5]; default: 0;
 *  Write 1 to clear AHB_DMA_OUTFIFO_UDF_CH4_INT.
 */
#define AHB_DMA_OUTFIFO_UDF_CH4_INT_CLR    (BIT(5))
#define AHB_DMA_OUTFIFO_UDF_CH4_INT_CLR_M  (AHB_DMA_OUTFIFO_UDF_CH4_INT_CLR_V << AHB_DMA_OUTFIFO_UDF_CH4_INT_CLR_S)
#define AHB_DMA_OUTFIFO_UDF_CH4_INT_CLR_V  0x00000001U
#define AHB_DMA_OUTFIFO_UDF_CH4_INT_CLR_S  5
/** AHB_DMA_OUT_AHBINF_RESP_ERR_CH4_INT_CLR : WT; bitpos: [6]; default: 0;
 *  Write 1 to clear AHB_DMA_OUT_RESP_ERR_CH4_INT.
 */
#define AHB_DMA_OUT_AHBINF_RESP_ERR_CH4_INT_CLR    (BIT(6))
#define AHB_DMA_OUT_AHBINF_RESP_ERR_CH4_INT_CLR_M  (AHB_DMA_OUT_AHBINF_RESP_ERR_CH4_INT_CLR_V << AHB_DMA_OUT_AHBINF_RESP_ERR_CH4_INT_CLR_S)
#define AHB_DMA_OUT_AHBINF_RESP_ERR_CH4_INT_CLR_V  0x00000001U
#define AHB_DMA_OUT_AHBINF_RESP_ERR_CH4_INT_CLR_S  6

/** AHB_DMA_AHB_TEST_REG register
 *  reserved
 */
#define AHB_DMA_AHB_TEST_REG (DR_REG_AHB_BASE + 0xa0)
/** AHB_DMA_AHB_TESTMODE : R/W; bitpos: [2:0]; default: 0;
 *  reserved
 */
#define AHB_DMA_AHB_TESTMODE    0x00000007U
#define AHB_DMA_AHB_TESTMODE_M  (AHB_DMA_AHB_TESTMODE_V << AHB_DMA_AHB_TESTMODE_S)
#define AHB_DMA_AHB_TESTMODE_V  0x00000007U
#define AHB_DMA_AHB_TESTMODE_S  0
/** AHB_DMA_AHB_TESTADDR : R/W; bitpos: [5:4]; default: 0;
 *  reserved
 */
#define AHB_DMA_AHB_TESTADDR    0x00000003U
#define AHB_DMA_AHB_TESTADDR_M  (AHB_DMA_AHB_TESTADDR_V << AHB_DMA_AHB_TESTADDR_S)
#define AHB_DMA_AHB_TESTADDR_V  0x00000003U
#define AHB_DMA_AHB_TESTADDR_S  4

/** AHB_DMA_MISC_CONF_REG register
 *  Miscellaneous register
 */
#define AHB_DMA_MISC_CONF_REG (DR_REG_AHB_BASE + 0xa4)
/** AHB_DMA_AHBM_RST_INTER : R/W; bitpos: [0]; default: 0;
 *  Write 1 and then 0 to reset the internal AHB FSM.
 */
#define AHB_DMA_AHBM_RST_INTER    (BIT(0))
#define AHB_DMA_AHBM_RST_INTER_M  (AHB_DMA_AHBM_RST_INTER_V << AHB_DMA_AHBM_RST_INTER_S)
#define AHB_DMA_AHBM_RST_INTER_V  0x00000001U
#define AHB_DMA_AHBM_RST_INTER_S  0
/** AHB_DMA_ARB_PRI_DIS : R/W; bitpos: [2]; default: 0;
 *  Configures whether to disable the fixed-priority channel arbitration.
 *  0: Enable
 *  1: Disable
 */
#define AHB_DMA_ARB_PRI_DIS    (BIT(2))
#define AHB_DMA_ARB_PRI_DIS_M  (AHB_DMA_ARB_PRI_DIS_V << AHB_DMA_ARB_PRI_DIS_S)
#define AHB_DMA_ARB_PRI_DIS_V  0x00000001U
#define AHB_DMA_ARB_PRI_DIS_S  2
/** AHB_DMA_CLK_EN : R/W; bitpos: [3]; default: 0;
 *  Configures clock gating.
 *  0: Support clock only when the application writes registers.
 *  1: Always force the clock on for registers.
 */
#define AHB_DMA_CLK_EN    (BIT(3))
#define AHB_DMA_CLK_EN_M  (AHB_DMA_CLK_EN_V << AHB_DMA_CLK_EN_S)
#define AHB_DMA_CLK_EN_V  0x00000001U
#define AHB_DMA_CLK_EN_S  3

/** AHB_DMA_DATE_REG register
 *  Version control register
 */
#define AHB_DMA_DATE_REG (DR_REG_AHB_BASE + 0xa8)
/** AHB_DMA_DATE : R/W; bitpos: [31:0]; default: 37778192;
 *  Version control register.
 */
#define AHB_DMA_DATE    0xFFFFFFFFU
#define AHB_DMA_DATE_M  (AHB_DMA_DATE_V << AHB_DMA_DATE_S)
#define AHB_DMA_DATE_V  0xFFFFFFFFU
#define AHB_DMA_DATE_S  0

