espressif/esp-idf/components/soc/esp32h4/register/soc/ahb_dma_reg.h
/** AHB_DMA_IN_POP_CH3_REG register
 *  Pop control register of RX channel 3
 */
#define AHB_DMA_IN_POP_CH3_REG (DR_REG_AHB_BASE + 0x40c)
/** AHB_DMA_INFIFO_RDATA_CH3 : RO; bitpos: [11:0]; default: 2048;
 *  Represents the data popped from AHB_DMA FIFO.
 */
#define AHB_DMA_INFIFO_RDATA_CH3    0x00000FFFU
#define AHB_DMA_INFIFO_RDATA_CH3_M  (AHB_DMA_INFIFO_RDATA_CH3_V << AHB_DMA_INFIFO_RDATA_CH3_S)
#define AHB_DMA_INFIFO_RDATA_CH3_V  0x00000FFFU
#define AHB_DMA_INFIFO_RDATA_CH3_S  0
/** AHB_DMA_INFIFO_POP_CH3 : WT; bitpos: [12]; default: 0;
 *  Configures whether to pop data from AHB_DMA FIFO.
 *  0: Invalid. No effect
 *  1: Pop
 */
#define AHB_DMA_INFIFO_POP_CH3    (BIT(12))
#define AHB_DMA_INFIFO_POP_CH3_M  (AHB_DMA_INFIFO_POP_CH3_V << AHB_DMA_INFIFO_POP_CH3_S)
#define AHB_DMA_INFIFO_POP_CH3_V  0x00000001U
#define AHB_DMA_INFIFO_POP_CH3_S  12

/** AHB_DMA_IN_LINK_CH3_REG register
 *  Linked list descriptor configuration and control register of RX channel 3
 */
#define AHB_DMA_IN_LINK_CH3_REG (DR_REG_AHB_BASE + 0x410)
/** AHB_DMA_INLINK_AUTO_RET_CH3 : R/W; bitpos: [0]; default: 1;
 *  Configures whether to return to current receive descriptor's address when there are
 *  some errors in current receiving data.
 *  0: Not return
 *  1: Return
 */
#define AHB_DMA_INLINK_AUTO_RET_CH3    (BIT(0))
#define AHB_DMA_INLINK_AUTO_RET_CH3_M  (AHB_DMA_INLINK_AUTO_RET_CH3_V << AHB_DMA_INLINK_AUTO_RET_CH3_S)
#define AHB_DMA_INLINK_AUTO_RET_CH3_V  0x00000001U
#define AHB_DMA_INLINK_AUTO_RET_CH3_S  0
/** AHB_DMA_INLINK_STOP_CH3 : WT; bitpos: [1]; default: 0;
 *  Configures whether to stop AHB_DMA's RX channel 3 from receiving data.
 *  0: Invalid. No effect
 *  1: Stop
 */
#define AHB_DMA_INLINK_STOP_CH3    (BIT(1))
#define AHB_DMA_INLINK_STOP_CH3_M  (AHB_DMA_INLINK_STOP_CH3_V << AHB_DMA_INLINK_STOP_CH3_S)
#define AHB_DMA_INLINK_STOP_CH3_V  0x00000001U
#define AHB_DMA_INLINK_STOP_CH3_S  1
/** AHB_DMA_INLINK_START_CH3 : WT; bitpos: [2]; default: 0;
 *  Configures whether to enable AHB_DMA's RX channel 3 for data transfer.
 *  0: Disable
 *  1: Enable
 */
#define AHB_DMA_INLINK_START_CH3    (BIT(2))
#define AHB_DMA_INLINK_START_CH3_M  (AHB_DMA_INLINK_START_CH3_V << AHB_DMA_INLINK_START_CH3_S)
#define AHB_DMA_INLINK_START_CH3_V  0x00000001U
#define AHB_DMA_INLINK_START_CH3_S  2
/** AHB_DMA_INLINK_RESTART_CH3 : WT; bitpos: [3]; default: 0;
 *  Configures whether to restart RX channel 3 for AHB_DMA transfer.
 *  0: Invalid. No effect
 *  1: Restart
 */
#define AHB_DMA_INLINK_RESTART_CH3    (BIT(3))
#define AHB_DMA_INLINK_RESTART_CH3_M  (AHB_DMA_INLINK_RESTART_CH3_V << AHB_DMA_INLINK_RESTART_CH3_S)
#define AHB_DMA_INLINK_RESTART_CH3_V  0x00000001U
#define AHB_DMA_INLINK_RESTART_CH3_S  3
/** AHB_DMA_INLINK_PARK_CH3 : RO; bitpos: [4]; default: 1;
 *  Represents the status of the receive descriptor's FSM.
 *  0: Running
 *  1: Idle
 */
#define AHB_DMA_INLINK_PARK_CH3    (BIT(4))
#define AHB_DMA_INLINK_PARK_CH3_M  (AHB_DMA_INLINK_PARK_CH3_V << AHB_DMA_INLINK_PARK_CH3_S)
#define AHB_DMA_INLINK_PARK_CH3_V  0x00000001U
#define AHB_DMA_INLINK_PARK_CH3_S  4

/** AHB_DMA_IN_LINK_ADDR_CH3_REG register
 *  Link list descriptor address configuration of RX channel 3
 */
#define AHB_DMA_IN_LINK_ADDR_CH3_REG (DR_REG_AHB_BASE + 0x414)
/** AHB_DMA_INLINK_ADDR_CH3 : R/W; bitpos: [31:0]; default: 0;
 *  Configures the 32 bits of the first receive descriptor's address.
 */
#define AHB_DMA_INLINK_ADDR_CH3    0xFFFFFFFFU
#define AHB_DMA_INLINK_ADDR_CH3_M  (AHB_DMA_INLINK_ADDR_CH3_V << AHB_DMA_INLINK_ADDR_CH3_S)
#define AHB_DMA_INLINK_ADDR_CH3_V  0xFFFFFFFFU
#define AHB_DMA_INLINK_ADDR_CH3_S  0

/** AHB_DMA_IN_STATE_CH3_REG register
 *  Receive status of RX channel 3
 */
#define AHB_DMA_IN_STATE_CH3_REG (DR_REG_AHB_BASE + 0x418)
/** AHB_DMA_INLINK_DSCR_ADDR_CH3 : RO; bitpos: [17:0]; default: 0;
 *  Represents the address of the lower 18 bits of the next receive descriptor to be
 *  processed.
 */
#define AHB_DMA_INLINK_DSCR_ADDR_CH3    0x0003FFFFU
#define AHB_DMA_INLINK_DSCR_ADDR_CH3_M  (AHB_DMA_INLINK_DSCR_ADDR_CH3_V << AHB_DMA_INLINK_DSCR_ADDR_CH3_S)
#define AHB_DMA_INLINK_DSCR_ADDR_CH3_V  0x0003FFFFU
#define AHB_DMA_INLINK_DSCR_ADDR_CH3_S  0
/** AHB_DMA_IN_DSCR_STATE_CH3 : RO; bitpos: [19:18]; default: 0;
 *  reserved
 */
#define AHB_DMA_IN_DSCR_STATE_CH3    0x00000003U
#define AHB_DMA_IN_DSCR_STATE_CH3_M  (AHB_DMA_IN_DSCR_STATE_CH3_V << AHB_DMA_IN_DSCR_STATE_CH3_S)
#define AHB_DMA_IN_DSCR_STATE_CH3_V  0x00000003U
#define AHB_DMA_IN_DSCR_STATE_CH3_S  18
/** AHB_DMA_IN_STATE_CH3 : RO; bitpos: [22:20]; default: 0;
 *  reserved
 */
#define AHB_DMA_IN_STATE_CH3    0x00000007U
#define AHB_DMA_IN_STATE_CH3_M  (AHB_DMA_IN_STATE_CH3_V << AHB_DMA_IN_STATE_CH3_S)
#define AHB_DMA_IN_STATE_CH3_V  0x00000007U
#define AHB_DMA_IN_STATE_CH3_S  20

/** AHB_DMA_IN_SUC_EOF_DES_ADDR_CH3_REG register
 *  Receive descriptor address when EOF occurs on RX channel 3
 */
#define AHB_DMA_IN_SUC_EOF_DES_ADDR_CH3_REG (DR_REG_AHB_BASE + 0x41c)
/** AHB_DMA_IN_SUC_EOF_DES_ADDR_CH3 : RO; bitpos: [31:0]; default: 0;
 *  Represents the address of the receive descriptor when the EOF bit in this
 *  descriptor is 1.
 */
#define AHB_DMA_IN_SUC_EOF_DES_ADDR_CH3    0xFFFFFFFFU
#define AHB_DMA_IN_SUC_EOF_DES_ADDR_CH3_M  (AHB_DMA_IN_SUC_EOF_DES_ADDR_CH3_V << AHB_DMA_IN_SUC_EOF_DES_ADDR_CH3_S)
#define AHB_DMA_IN_SUC_EOF_DES_ADDR_CH3_V  0xFFFFFFFFU
#define AHB_DMA_IN_SUC_EOF_DES_ADDR_CH3_S  0

/** AHB_DMA_IN_ERR_EOF_DES_ADDR_CH3_REG register
 *  Receive descriptor address when errors occur of RX channel 3
 */
#define AHB_DMA_IN_ERR_EOF_DES_ADDR_CH3_REG (DR_REG_AHB_BASE + 0x420)
/** AHB_DMA_IN_ERR_EOF_DES_ADDR_CH3 : RO; bitpos: [31:0]; default: 0;
 *  Represents the address of the receive descriptor when there are some errors in the
 *  currently received data.
 */
#define AHB_DMA_IN_ERR_EOF_DES_ADDR_CH3    0xFFFFFFFFU
#define AHB_DMA_IN_ERR_EOF_DES_ADDR_CH3_M  (AHB_DMA_IN_ERR_EOF_DES_ADDR_CH3_V << AHB_DMA_IN_ERR_EOF_DES_ADDR_CH3_S)
#define AHB_DMA_IN_ERR_EOF_DES_ADDR_CH3_V  0xFFFFFFFFU
#define AHB_DMA_IN_ERR_EOF_DES_ADDR_CH3_S  0

/** AHB_DMA_IN_DONE_DES_ADDR_CH3_REG register
 *  RX_done inlink descriptor address of RX channel 3
 */
#define AHB_DMA_IN_DONE_DES_ADDR_CH3_REG (DR_REG_AHB_BASE + 0x424)
/** AHB_DMA_IN_DONE_DES_ADDR_CH3 : RO; bitpos: [31:0]; default: 0;
 *  Represents the address of the inlink descriptor when  this descriptor is completed .
 */
#define AHB_DMA_IN_DONE_DES_ADDR_CH3    0xFFFFFFFFU
#define AHB_DMA_IN_DONE_DES_ADDR_CH3_M  (AHB_DMA_IN_DONE_DES_ADDR_CH3_V << AHB_DMA_IN_DONE_DES_ADDR_CH3_S)
#define AHB_DMA_IN_DONE_DES_ADDR_CH3_V  0xFFFFFFFFU
#define AHB_DMA_IN_DONE_DES_ADDR_CH3_S  0

/** AHB_DMA_IN_DSCR_CH3_REG register
 *  Current receive descriptor address of RX channel 3
 */
#define AHB_DMA_IN_DSCR_CH3_REG (DR_REG_AHB_BASE + 0x428)
/** AHB_DMA_INLINK_DSCR_CH3 : RO; bitpos: [31:0]; default: 0;
 *  Represents the address of the next receive descriptor x+1 pointed by the current
 *  receive descriptor that has already been fetched.
 */
#define AHB_DMA_INLINK_DSCR_CH3    0xFFFFFFFFU
#define AHB_DMA_INLINK_DSCR_CH3_M  (AHB_DMA_INLINK_DSCR_CH3_V << AHB_DMA_INLINK_DSCR_CH3_S)
#define AHB_DMA_INLINK_DSCR_CH3_V  0xFFFFFFFFU
#define AHB_DMA_INLINK_DSCR_CH3_S  0

/** AHB_DMA_IN_DSCR_BF0_CH3_REG register
 *  The last receive descriptor address of RX channel 3
 */
#define AHB_DMA_IN_DSCR_BF0_CH3_REG (DR_REG_AHB_BASE + 0x42c)
/** AHB_DMA_INLINK_DSCR_BF0_CH3 : RO; bitpos: [31:0]; default: 0;
 *  Represents the address of the current receive descriptor x that has already been
 *  fetched.
 */
#define AHB_DMA_INLINK_DSCR_BF0_CH3    0xFFFFFFFFU
#define AHB_DMA_INLINK_DSCR_BF0_CH3_M  (AHB_DMA_INLINK_DSCR_BF0_CH3_V << AHB_DMA_INLINK_DSCR_BF0_CH3_S)
#define AHB_DMA_INLINK_DSCR_BF0_CH3_V  0xFFFFFFFFU
#define AHB_DMA_INLINK_DSCR_BF0_CH3_S  0

/** AHB_DMA_IN_DSCR_BF1_CH3_REG register
 *  The second-to-last receive descriptor address of RX channel 3
 */
#define AHB_DMA_IN_DSCR_BF1_CH3_REG (DR_REG_AHB_BASE + 0x430)
/** AHB_DMA_INLINK_DSCR_BF1_CH3 : RO; bitpos: [31:0]; default: 0;
 *  Represents the address of the previous receive descriptor x-1 that has already been
 *  fetched.
 */
#define AHB_DMA_INLINK_DSCR_BF1_CH3    0xFFFFFFFFU
#define AHB_DMA_INLINK_DSCR_BF1_CH3_M  (AHB_DMA_INLINK_DSCR_BF1_CH3_V << AHB_DMA_INLINK_DSCR_BF1_CH3_S)
#define AHB_DMA_INLINK_DSCR_BF1_CH3_V  0xFFFFFFFFU
#define AHB_DMA_INLINK_DSCR_BF1_CH3_S  0

