espressif/esp-idf/components/soc/esp32h4/register/soc/ahb_dma_reg.h
/** AHB_DMA_IN_PRI_CH4_REG register
 *  Priority register of RX channel 4
 */
#define AHB_DMA_IN_PRI_CH4_REG (DR_REG_AHB_BASE + 0x534)
/** AHB_DMA_RX_PRI_CH4 : R/W; bitpos: [3:0]; default: 0;
 *  Configures the priority of RX channel 4.The larger of the value, the higher of the
 *  priority.
 */
#define AHB_DMA_RX_PRI_CH4    0x0000000FU
#define AHB_DMA_RX_PRI_CH4_M  (AHB_DMA_RX_PRI_CH4_V << AHB_DMA_RX_PRI_CH4_S)
#define AHB_DMA_RX_PRI_CH4_V  0x0000000FU
#define AHB_DMA_RX_PRI_CH4_S  0

/** AHB_DMA_IN_PERI_SEL_CH4_REG register
 *  Peripheral selection register of RX channel 4
 */
#define AHB_DMA_IN_PERI_SEL_CH4_REG (DR_REG_AHB_BASE + 0x538)
/** AHB_DMA_PERI_IN_SEL_CH4 : R/W; bitpos: [5:0]; default: 63;
 *  Configures the peripheral connected to RX channel 4.
 *  0: SPI3
 *  1: SPI2
 *  2: UHCI0
 *  3: I2S0
 *  4: AES
 *  5: Sample_rate_convert-0
 *  6:  Sample_rate_convert-1
 *  7: SHA
 *  8: ADC_DAC
 *  9: PARL_IO
 *  10: Dummy
 *  11~15: Dummy
 */
#define AHB_DMA_PERI_IN_SEL_CH4    0x0000003FU
#define AHB_DMA_PERI_IN_SEL_CH4_M  (AHB_DMA_PERI_IN_SEL_CH4_V << AHB_DMA_PERI_IN_SEL_CH4_S)
#define AHB_DMA_PERI_IN_SEL_CH4_V  0x0000003FU
#define AHB_DMA_PERI_IN_SEL_CH4_S  0

/** AHB_DMA_RX_CH_ARB_WEIGH_CH4_REG register
 *  RX channel 4 arbitration weight configuration register
 */
#define AHB_DMA_RX_CH_ARB_WEIGH_CH4_REG (DR_REG_AHB_BASE + 0x53c)
/** AHB_DMA_RX_CH_ARB_WEIGH_CH4 : R/W; bitpos: [3:0]; default: 0;
 *  Configures the weight(i.e the number of tokens) of RX channel4
 */
#define AHB_DMA_RX_CH_ARB_WEIGH_CH4    0x0000000FU
#define AHB_DMA_RX_CH_ARB_WEIGH_CH4_M  (AHB_DMA_RX_CH_ARB_WEIGH_CH4_V << AHB_DMA_RX_CH_ARB_WEIGH_CH4_S)
#define AHB_DMA_RX_CH_ARB_WEIGH_CH4_V  0x0000000FU
#define AHB_DMA_RX_CH_ARB_WEIGH_CH4_S  0

/** AHB_DMA_RX_ARB_WEIGH_OPT_DIR_CH4_REG register
 *  RX channel 4 weight arbitration optimization enable register
 */
#define AHB_DMA_RX_ARB_WEIGH_OPT_DIR_CH4_REG (DR_REG_AHB_BASE + 0x540)
/** AHB_DMA_RX_ARB_WEIGH_OPT_DIR_CH4 : R/W; bitpos: [0]; default: 0;
 *  reserved
 */
#define AHB_DMA_RX_ARB_WEIGH_OPT_DIR_CH4    (BIT(0))
#define AHB_DMA_RX_ARB_WEIGH_OPT_DIR_CH4_M  (AHB_DMA_RX_ARB_WEIGH_OPT_DIR_CH4_V << AHB_DMA_RX_ARB_WEIGH_OPT_DIR_CH4_S)
#define AHB_DMA_RX_ARB_WEIGH_OPT_DIR_CH4_V  0x00000001U
#define AHB_DMA_RX_ARB_WEIGH_OPT_DIR_CH4_S  0

/** AHB_DMA_OUT_CONF0_CH4_REG register
 *  Configuration register 0 of TX channel 4
 */
#define AHB_DMA_OUT_CONF0_CH4_REG (DR_REG_AHB_BASE + 0x580)
/** AHB_DMA_OUT_RST_CH4 : R/W; bitpos: [0]; default: 0;
 *  Configures the reset state of AHB_DMA channel 4 TX FSM and TX FIFO pointer.
 *  0: Release reset
 *  1: Reset
 */
#define AHB_DMA_OUT_RST_CH4    (BIT(0))
#define AHB_DMA_OUT_RST_CH4_M  (AHB_DMA_OUT_RST_CH4_V << AHB_DMA_OUT_RST_CH4_S)
#define AHB_DMA_OUT_RST_CH4_V  0x00000001U
#define AHB_DMA_OUT_RST_CH4_S  0
/** AHB_DMA_OUT_LOOP_TEST_CH4 : R/W; bitpos: [1]; default: 0;
 *  Reserved.
 */
#define AHB_DMA_OUT_LOOP_TEST_CH4    (BIT(1))
#define AHB_DMA_OUT_LOOP_TEST_CH4_M  (AHB_DMA_OUT_LOOP_TEST_CH4_V << AHB_DMA_OUT_LOOP_TEST_CH4_S)
#define AHB_DMA_OUT_LOOP_TEST_CH4_V  0x00000001U
#define AHB_DMA_OUT_LOOP_TEST_CH4_S  1
/** AHB_DMA_OUT_AUTO_WRBACK_CH4 : R/W; bitpos: [2]; default: 0;
 *  Configures whether to enable automatic outlink write-back when all the data in TX
 *  FIFO has been transmitted.
 *  0: Disable
 *  1: Enable
 */
#define AHB_DMA_OUT_AUTO_WRBACK_CH4    (BIT(2))
#define AHB_DMA_OUT_AUTO_WRBACK_CH4_M  (AHB_DMA_OUT_AUTO_WRBACK_CH4_V << AHB_DMA_OUT_AUTO_WRBACK_CH4_S)
#define AHB_DMA_OUT_AUTO_WRBACK_CH4_V  0x00000001U
#define AHB_DMA_OUT_AUTO_WRBACK_CH4_S  2
/** AHB_DMA_OUT_EOF_MODE_CH4 : R/W; bitpos: [3]; default: 1;
 *  Configures when to generate EOF flag.
 *  0: EOF flag for TX channel 4 is generated when data to be transmitted has been
 *  pushed into FIFO in AHB_DMA.
 *  1: EOF flag for TX channel 4 is generated when data to be transmitted has been
 *  popped from FIFO in AHB_DMA.
 */
#define AHB_DMA_OUT_EOF_MODE_CH4    (BIT(3))
#define AHB_DMA_OUT_EOF_MODE_CH4_M  (AHB_DMA_OUT_EOF_MODE_CH4_V << AHB_DMA_OUT_EOF_MODE_CH4_S)
#define AHB_DMA_OUT_EOF_MODE_CH4_V  0x00000001U
#define AHB_DMA_OUT_EOF_MODE_CH4_S  3
/** AHB_DMA_OUTDSCR_BURST_EN_CH4 : R/W; bitpos: [4]; default: 0;
 *  Configures whether to enable INCR burst transfer for TX channel 4 reading
 *  descriptors.
 *  0: Disable
 *  1: Enable
 */
#define AHB_DMA_OUTDSCR_BURST_EN_CH4    (BIT(4))
#define AHB_DMA_OUTDSCR_BURST_EN_CH4_M  (AHB_DMA_OUTDSCR_BURST_EN_CH4_V << AHB_DMA_OUTDSCR_BURST_EN_CH4_S)
#define AHB_DMA_OUTDSCR_BURST_EN_CH4_V  0x00000001U
#define AHB_DMA_OUTDSCR_BURST_EN_CH4_S  4
/** AHB_DMA_OUT_ETM_EN_CH4 : R/W; bitpos: [6]; default: 0;
 *  Configures whether to enable ETM control for TX channel 4.
 *  0: Disable
 *  1: Enable
 */
#define AHB_DMA_OUT_ETM_EN_CH4    (BIT(6))
#define AHB_DMA_OUT_ETM_EN_CH4_M  (AHB_DMA_OUT_ETM_EN_CH4_V << AHB_DMA_OUT_ETM_EN_CH4_S)
#define AHB_DMA_OUT_ETM_EN_CH4_V  0x00000001U
#define AHB_DMA_OUT_ETM_EN_CH4_S  6
/** AHB_DMA_OUT_DATA_BURST_MODE_SEL_CH4 : R/W; bitpos: [9:8]; default: 0;
 *  Configures max burst size for TX channel4.
 *  2'b00: single
 *  2'b01: incr4
 *  2'b10: incr8
 *  2'b11: incr16
 */
#define AHB_DMA_OUT_DATA_BURST_MODE_SEL_CH4    0x00000003U
#define AHB_DMA_OUT_DATA_BURST_MODE_SEL_CH4_M  (AHB_DMA_OUT_DATA_BURST_MODE_SEL_CH4_V << AHB_DMA_OUT_DATA_BURST_MODE_SEL_CH4_S)
#define AHB_DMA_OUT_DATA_BURST_MODE_SEL_CH4_V  0x00000003U
#define AHB_DMA_OUT_DATA_BURST_MODE_SEL_CH4_S  8

/** AHB_DMA_OUT_CONF1_CH4_REG register
 *  Configuration register 1 of TX channel 4
 */
#define AHB_DMA_OUT_CONF1_CH4_REG (DR_REG_AHB_BASE + 0x584)
/** AHB_DMA_OUT_CHECK_OWNER_CH4 : R/W; bitpos: [12]; default: 0;
 *  Configures whether to enable owner bit check for TX channel 4.
 *  0: Disable
 *  1: Enable
 */
#define AHB_DMA_OUT_CHECK_OWNER_CH4    (BIT(12))
#define AHB_DMA_OUT_CHECK_OWNER_CH4_M  (AHB_DMA_OUT_CHECK_OWNER_CH4_V << AHB_DMA_OUT_CHECK_OWNER_CH4_S)
#define AHB_DMA_OUT_CHECK_OWNER_CH4_V  0x00000001U
#define AHB_DMA_OUT_CHECK_OWNER_CH4_S  12

/** AHB_DMA_OUTFIFO_STATUS_CH4_REG register
 *  Transmit FIFO status of TX channel 4
 */
#define AHB_DMA_OUTFIFO_STATUS_CH4_REG (DR_REG_AHB_BASE + 0x588)
/** AHB_DMA_OUTFIFO_FULL_CH4 : RO; bitpos: [0]; default: 0;
 *  Represents whether L1 TX FIFO is full.
 *  0: Not Full
 *  1: Full
 */
#define AHB_DMA_OUTFIFO_FULL_CH4    (BIT(0))
#define AHB_DMA_OUTFIFO_FULL_CH4_M  (AHB_DMA_OUTFIFO_FULL_CH4_V << AHB_DMA_OUTFIFO_FULL_CH4_S)
#define AHB_DMA_OUTFIFO_FULL_CH4_V  0x00000001U
#define AHB_DMA_OUTFIFO_FULL_CH4_S  0
/** AHB_DMA_OUTFIFO_EMPTY_CH4 : RO; bitpos: [1]; default: 1;
 *  Represents whether L1 TX FIFO is empty.
 *  0: Not empty
 *  1: Empty
 */
#define AHB_DMA_OUTFIFO_EMPTY_CH4    (BIT(1))
#define AHB_DMA_OUTFIFO_EMPTY_CH4_M  (AHB_DMA_OUTFIFO_EMPTY_CH4_V << AHB_DMA_OUTFIFO_EMPTY_CH4_S)
#define AHB_DMA_OUTFIFO_EMPTY_CH4_V  0x00000001U
#define AHB_DMA_OUTFIFO_EMPTY_CH4_S  1
/** AHB_DMA_OUTFIFO_CNT_CH4 : RO; bitpos: [14:8]; default: 0;
 *  Represents the number of data bytes in L1 TX FIFO for TX channel 4.
 */
#define AHB_DMA_OUTFIFO_CNT_CH4    0x0000007FU
#define AHB_DMA_OUTFIFO_CNT_CH4_M  (AHB_DMA_OUTFIFO_CNT_CH4_V << AHB_DMA_OUTFIFO_CNT_CH4_S)
#define AHB_DMA_OUTFIFO_CNT_CH4_V  0x0000007FU
#define AHB_DMA_OUTFIFO_CNT_CH4_S  8
/** AHB_DMA_OUT_REMAIN_UNDER_1B_CH4 : RO; bitpos: [23]; default: 1;
 *  Reserved.
 */
#define AHB_DMA_OUT_REMAIN_UNDER_1B_CH4    (BIT(23))
#define AHB_DMA_OUT_REMAIN_UNDER_1B_CH4_M  (AHB_DMA_OUT_REMAIN_UNDER_1B_CH4_V << AHB_DMA_OUT_REMAIN_UNDER_1B_CH4_S)
#define AHB_DMA_OUT_REMAIN_UNDER_1B_CH4_V  0x00000001U
#define AHB_DMA_OUT_REMAIN_UNDER_1B_CH4_S  23
/** AHB_DMA_OUT_REMAIN_UNDER_2B_CH4 : RO; bitpos: [24]; default: 1;
 *  Reserved.
 */
#define AHB_DMA_OUT_REMAIN_UNDER_2B_CH4    (BIT(24))
#define AHB_DMA_OUT_REMAIN_UNDER_2B_CH4_M  (AHB_DMA_OUT_REMAIN_UNDER_2B_CH4_V << AHB_DMA_OUT_REMAIN_UNDER_2B_CH4_S)
#define AHB_DMA_OUT_REMAIN_UNDER_2B_CH4_V  0x00000001U
#define AHB_DMA_OUT_REMAIN_UNDER_2B_CH4_S  24
/** AHB_DMA_OUT_REMAIN_UNDER_3B_CH4 : RO; bitpos: [25]; default: 1;
 *  Reserved.
 */
#define AHB_DMA_OUT_REMAIN_UNDER_3B_CH4    (BIT(25))
#define AHB_DMA_OUT_REMAIN_UNDER_3B_CH4_M  (AHB_DMA_OUT_REMAIN_UNDER_3B_CH4_V << AHB_DMA_OUT_REMAIN_UNDER_3B_CH4_S)
#define AHB_DMA_OUT_REMAIN_UNDER_3B_CH4_V  0x00000001U
#define AHB_DMA_OUT_REMAIN_UNDER_3B_CH4_S  25
/** AHB_DMA_OUT_REMAIN_UNDER_4B_CH4 : RO; bitpos: [26]; default: 1;
 *  Reserved.
 */
#define AHB_DMA_OUT_REMAIN_UNDER_4B_CH4    (BIT(26))
#define AHB_DMA_OUT_REMAIN_UNDER_4B_CH4_M  (AHB_DMA_OUT_REMAIN_UNDER_4B_CH4_V << AHB_DMA_OUT_REMAIN_UNDER_4B_CH4_S)
#define AHB_DMA_OUT_REMAIN_UNDER_4B_CH4_V  0x00000001U
#define AHB_DMA_OUT_REMAIN_UNDER_4B_CH4_S  26

/** AHB_DMA_OUT_PUSH_CH4_REG register
 *  Push control register of TX channel 4
 */
#define AHB_DMA_OUT_PUSH_CH4_REG (DR_REG_AHB_BASE + 0x58c)
/** AHB_DMA_OUTFIFO_WDATA_CH4 : R/W; bitpos: [8:0]; default: 0;
 *  Configures the data that need to be pushed into AHB_DMA FIFO.
 */
#define AHB_DMA_OUTFIFO_WDATA_CH4    0x000001FFU
#define AHB_DMA_OUTFIFO_WDATA_CH4_M  (AHB_DMA_OUTFIFO_WDATA_CH4_V << AHB_DMA_OUTFIFO_WDATA_CH4_S)
#define AHB_DMA_OUTFIFO_WDATA_CH4_V  0x000001FFU
#define AHB_DMA_OUTFIFO_WDATA_CH4_S  0
/** AHB_DMA_OUTFIFO_PUSH_CH4 : WT; bitpos: [9]; default: 0;
 *  Configures whether to push data into AHB_DMA FIFO.
 *  0: Invalid. No effect
 *  1: Push
 */
#define AHB_DMA_OUTFIFO_PUSH_CH4    (BIT(9))
#define AHB_DMA_OUTFIFO_PUSH_CH4_M  (AHB_DMA_OUTFIFO_PUSH_CH4_V << AHB_DMA_OUTFIFO_PUSH_CH4_S)
#define AHB_DMA_OUTFIFO_PUSH_CH4_V  0x00000001U
#define AHB_DMA_OUTFIFO_PUSH_CH4_S  9

/** AHB_DMA_OUT_LINK_CH4_REG register
 *  Linked list descriptor configuration and control register of TX channel 4
 */
#define AHB_DMA_OUT_LINK_CH4_REG (DR_REG_AHB_BASE + 0x590)
/** AHB_DMA_OUTLINK_STOP_CH4 : WT; bitpos: [0]; default: 0;
 *  Configures whether to stop AHB_DMA's TX channel 4 from transmitting data.
 *  0: Invalid. No effect
 *  1: Stop
 */
#define AHB_DMA_OUTLINK_STOP_CH4    (BIT(0))
#define AHB_DMA_OUTLINK_STOP_CH4_M  (AHB_DMA_OUTLINK_STOP_CH4_V << AHB_DMA_OUTLINK_STOP_CH4_S)
#define AHB_DMA_OUTLINK_STOP_CH4_V  0x00000001U
#define AHB_DMA_OUTLINK_STOP_CH4_S  0
/** AHB_DMA_OUTLINK_START_CH4 : WT; bitpos: [1]; default: 0;
 *  Configures whether to enable AHB_DMA's TX channel 4 for data transfer.
 *  0: Disable
 *  1: Enable
 */
#define AHB_DMA_OUTLINK_START_CH4    (BIT(1))
#define AHB_DMA_OUTLINK_START_CH4_M  (AHB_DMA_OUTLINK_START_CH4_V << AHB_DMA_OUTLINK_START_CH4_S)
#define AHB_DMA_OUTLINK_START_CH4_V  0x00000001U
#define AHB_DMA_OUTLINK_START_CH4_S  1
/** AHB_DMA_OUTLINK_RESTART_CH4 : WT; bitpos: [2]; default: 0;
 *  Configures whether to restart TX channel 4 for AHB_DMA transfer.
 *  0: Invalid. No effect
 *  1: Restart
 */
#define AHB_DMA_OUTLINK_RESTART_CH4    (BIT(2))
#define AHB_DMA_OUTLINK_RESTART_CH4_M  (AHB_DMA_OUTLINK_RESTART_CH4_V << AHB_DMA_OUTLINK_RESTART_CH4_S)
#define AHB_DMA_OUTLINK_RESTART_CH4_V  0x00000001U
#define AHB_DMA_OUTLINK_RESTART_CH4_S  2
/** AHB_DMA_OUTLINK_PARK_CH4 : RO; bitpos: [3]; default: 1;
 *  Represents the status of the transmit descriptor's FSM.
 *  0: Running
 *  1: Idle
 */
#define AHB_DMA_OUTLINK_PARK_CH4    (BIT(3))
#define AHB_DMA_OUTLINK_PARK_CH4_M  (AHB_DMA_OUTLINK_PARK_CH4_V << AHB_DMA_OUTLINK_PARK_CH4_S)
#define AHB_DMA_OUTLINK_PARK_CH4_V  0x00000001U
#define AHB_DMA_OUTLINK_PARK_CH4_S  3

/** AHB_DMA_OUT_LINK_ADDR_CH4_REG register
 *  Link list descriptor address configuration of TX channel 4
 */
#define AHB_DMA_OUT_LINK_ADDR_CH4_REG (DR_REG_AHB_BASE + 0x594)
/** AHB_DMA_OUTLINK_ADDR_CH4 : R/W; bitpos: [31:0]; default: 0;
 *  Configures the 32 bits of the first receive descriptor's address.
 */
#define AHB_DMA_OUTLINK_ADDR_CH4    0xFFFFFFFFU
#define AHB_DMA_OUTLINK_ADDR_CH4_M  (AHB_DMA_OUTLINK_ADDR_CH4_V << AHB_DMA_OUTLINK_ADDR_CH4_S)
#define AHB_DMA_OUTLINK_ADDR_CH4_V  0xFFFFFFFFU
#define AHB_DMA_OUTLINK_ADDR_CH4_S  0

/** AHB_DMA_OUT_STATE_CH4_REG register
 *  Transmit status of TX channel 4
 */
#define AHB_DMA_OUT_STATE_CH4_REG (DR_REG_AHB_BASE + 0x598)
/** AHB_DMA_OUTLINK_DSCR_ADDR_CH4 : RO; bitpos: [17:0]; default: 0;
 *  Represents the lower 18 bits of the address of the next transmit descriptor to be
 *  processed.
 */
#define AHB_DMA_OUTLINK_DSCR_ADDR_CH4    0x0003FFFFU
#define AHB_DMA_OUTLINK_DSCR_ADDR_CH4_M  (AHB_DMA_OUTLINK_DSCR_ADDR_CH4_V << AHB_DMA_OUTLINK_DSCR_ADDR_CH4_S)
#define AHB_DMA_OUTLINK_DSCR_ADDR_CH4_V  0x0003FFFFU
#define AHB_DMA_OUTLINK_DSCR_ADDR_CH4_S  0
/** AHB_DMA_OUT_DSCR_STATE_CH4 : RO; bitpos: [19:18]; default: 0;
 *  reserved
 */
#define AHB_DMA_OUT_DSCR_STATE_CH4    0x00000003U
#define AHB_DMA_OUT_DSCR_STATE_CH4_M  (AHB_DMA_OUT_DSCR_STATE_CH4_V << AHB_DMA_OUT_DSCR_STATE_CH4_S)
#define AHB_DMA_OUT_DSCR_STATE_CH4_V  0x00000003U
#define AHB_DMA_OUT_DSCR_STATE_CH4_S  18
/** AHB_DMA_OUT_STATE_CH4 : RO; bitpos: [22:20]; default: 0;
 *  reserved
 */
#define AHB_DMA_OUT_STATE_CH4    0x00000007U
#define AHB_DMA_OUT_STATE_CH4_M  (AHB_DMA_OUT_STATE_CH4_V << AHB_DMA_OUT_STATE_CH4_S)
#define AHB_DMA_OUT_STATE_CH4_V  0x00000007U
#define AHB_DMA_OUT_STATE_CH4_S  20

/** AHB_DMA_OUT_EOF_DES_ADDR_CH4_REG register
 *  Transmit descriptor address when EOF occurs on TX channel 4
 */
#define AHB_DMA_OUT_EOF_DES_ADDR_CH4_REG (DR_REG_AHB_BASE + 0x59c)
/** AHB_DMA_OUT_EOF_DES_ADDR_CH4 : RO; bitpos: [31:0]; default: 0;
 *  Represents the address of the transmit descriptor when the EOF bit in this
 *  descriptor is 1.
 */
#define AHB_DMA_OUT_EOF_DES_ADDR_CH4    0xFFFFFFFFU
#define AHB_DMA_OUT_EOF_DES_ADDR_CH4_M  (AHB_DMA_OUT_EOF_DES_ADDR_CH4_V << AHB_DMA_OUT_EOF_DES_ADDR_CH4_S)
#define AHB_DMA_OUT_EOF_DES_ADDR_CH4_V  0xFFFFFFFFU
#define AHB_DMA_OUT_EOF_DES_ADDR_CH4_S  0

